In [9]:
import numpy as np

In [10]:

x = np.arange(15, dtype=np.int64).reshape(3, 5)
x[1:, ::2] = -99
x

array([[  0,   1,   2,   3,   4],
       [-99,   6, -99,   8, -99],
       [-99,  11, -99,  13, -99]])

In [11]:

arr1d = np.array([1, 2, 3, 4, 5])
print("Multiply")
print("Sum of elements in arr1d:", np.sum(arr1d))
print("Mean of elements in arr1d:", np.mean(arr1d))

Multiply
Sum of elements in arr1d: 15
Mean of elements in arr1d: 3.0

In [13]:
import pandas as pd

# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 22],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}

df = pd.DataFrame(data)
print("DataFrame:")
print(df)

# Accessing columns
print("\nAccessing Columns:")
print("Names:")
print(df['Name'])
print("\nAges:")
print(df['Age'])

DataFrame:
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   22        Chicago

Accessing Columns:
Names:
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

Ages:
0    25
1    30
2    35
3    22
Name: Age, dtype: int64

In [1]:
library(tidyverse)

# Create a sample messy dataset
messy_data <- data.frame(
  ID = c(1, 2, 3),
  Name = c("Alice", "Bob", "Charlie"),
  Test1 = c(95, NA, 75),
  Test2 = c(85, 90, NA),
  Test3 = c(80, 88, 92)
)

# Display the messy dataset
print("Messy Dataset:")
print(messy_data)

# Reshape the dataset using tidyr's pivot_longer function
tidy_data <- messy_data %>%
  pivot_longer(cols = starts_with("Test"),
               names_to = "Test",
               values_to = "Score")

# Display the tidy dataset
print("\nTidy Dataset:")
print(tidy_data)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.4.4     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.0
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

[1] "Messy Dataset:"
  ID    Name Test1 Test2 Test3
1  1   Alice    95    85    80
2  2     Bob    NA    90    88
3  3 Charlie    75    NA    92
[1] "\nTidy Dataset:"
# A tibble: 9 × 4
     ID Name    Test  Score
  <dbl> <chr>   <chr> <dbl>
1     1 Alice   Test1    95
2     1 Alice   Test2    85
3     1 Alice   Test3    80
4     2 Bob     Test1    NA
5     2 Bob     Test2    90
6     2 Bob     Test3    88
7     3 Charlie Test1    75
8     3 Charlie Test2    NA
9     3 Charlie Test3    92

In [2]:

library(dplyr)

# Create a sample dataset
data <- data.frame(
  ID = c(1, 2, 3, 4, 5),
  Name = c("Alice", "Bob", "Charlie", "David", "Eve"),
  Age = c(25, 30, 35, 22, 28),
  City = c("New York", "San Francisco", "Los Angeles", "Chicago", "Miami"),
  Salary = c(60000, 70000, 80000, 50000, 75000)
)

# Display the original dataset
print("Original Dataset:")
print(data)

# Filter rows based on a condition
filtered_data <- data %>%
  filter(Age > 25)

# Display the filtered dataset
print("\nFiltered Dataset (Age > 25):")
print(filtered_data)

# Select specific columns
selected_columns <- data %>%
  select(Name, City)

# Display the dataset with selected columns
print("\nDataset with Selected Columns:")
print(selected_columns)

# Create a new column
data_with_bonus <- data %>%
  mutate(SalaryWithBonus = Salary * 1.1)

# Display the dataset with the new column
print("\nDataset with Salary Bonus:")
print(data_with_bonus)

# Group by City and calculate average salary
average_salary_by_city <- data %>%
  group_by(City) %>%
  summarize(AverageSalary = mean(Salary))

# Display the average salary by city
print("\nAverage Salary by City:")
print(average_salary_by_city)

[1] "Original Dataset:"
  ID    Name Age          City Salary
1  1   Alice  25      New York  60000
2  2     Bob  30 San Francisco  70000
3  3 Charlie  35   Los Angeles  80000
4  4   David  22       Chicago  50000
5  5     Eve  28         Miami  75000
[1] "\nFiltered Dataset (Age > 25):"
  ID    Name Age          City Salary
1  2     Bob  30 San Francisco  70000
2  3 Charlie  35   Los Angeles  80000
3  5     Eve  28         Miami  75000
[1] "\nDataset with Selected Columns:"
     Name          City
1   Alice      New York
2     Bob San Francisco
3 Charlie   Los Angeles
4   David       Chicago
5     Eve         Miami
[1] "\nDataset with Salary Bonus:"
  ID    Name Age          City Salary SalaryWithBonus
1  1   Alice  25      New York  60000           66000
2  2     Bob  30 San Francisco  70000           77000
3  3 Charlie  35   Los Angeles  80000           88000
4  4   David  22       Chicago  50000           55000
5  5     Eve  28         Miami  75000           82500
[1] "\nAverage Salary by City:"
# A tibble: 5 × 2
  City          AverageSalary
  <chr>                 <dbl>
1 Chicago               50000
2 Los Angeles           80000
3 Miami                 75000
4 New York              60000
5 San Francisco         70000